GetCheckSymbolIndustry<-"   11 水泥工業  "
GetCheckSymbolCompany<-" 1101 台灣水泥  " 

regexec("^\ [0-9]{4}"," 1101 台灣水泥  " )
#[#[[1]]]
#[[1]] 1
attr(,"match.length")
#[[1]] 5
regexec("^\ {3}[0-9]{4}"," 1101 台灣水泥  " )
#[#[[1]]]
#[[1]] -1
attr(,"match.length")
#[[1]] -1

#grep
grep("^\ [0-9]{4}"," 1101 台灣水泥  " )
#[[1]] 1
grep("^\ {3}[0-9]{4}"," 1101 台灣水泥  " )
integer(0)
grep("^\ [0-9]{4}"," 1101 台灣水泥  " )==1
#[[1]] TRUE

#grepl
grepl("^\ [0-9]{4}"," 1101 台灣水泥  " )
#[[1]] TRUE
grepl("^\ {3}[0-9]{4}"," 1101 台灣水泥  " )
#[[1]] FALSE

#
grepl("^\ *[(]",CheckSymbol2)

#奇數都是TRUE
regexec("^\ {3}[0-9]{2,4}",GetCheckSymbolIndustry)#[#[[1]]]#[[1]]

cat(gsub(" ",replacement="\",\"", "公司代號	公司名稱	股利所屬年度	權利分派基準日  餘轉增資配股(元/股)	法定盈餘公積、資本公積轉增資配股(元/股)	配股總股數(股)	配股總金額(元)	配股總股數佔盈餘配股總股數之比例(%)	員工紅利配股率	盈餘分配之股東現金股利(元/股)	法定盈餘公積、資本公積發放之現金(元/股)  除息交易日	現金股利發放日	員工紅利總金額(元)  現金增資總股數(股)	現金增資認股比率(%)	現金增資認購價(元/股)	董監酬勞(元)	公告日期	公告時間	普通股每股面額",fixed = TRUE));